[<img src="https://user-images.githubusercontent.com/104052797/227734220-c880c683-a61d-41d7-8595-017d1feae370.jpg" alt="Pankaj Kumar Yadav" style="width: 200px; height: auto;">](https://www.linkedin.com/in/pankaj-kr-yadav/) &copy; 2023 `Pankaj Kumar Yadav`. All rights reserved.

----

# üìç 01 Pandas Basic üìç

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

### Answer:

In [1]:
# import pandas to do all task
import pandas as pd

In [27]:
data_q1 = [4,8,15,16,23,42]
df_q1 = pd.Series(data)

In [28]:
df_q1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [29]:
type(df_q1)

pandas.core.series.Series

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

## Answer:

In [30]:
data_q2 = list(range(2,22,2))
data_q2

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [31]:
len(data_q2)

10

In [32]:
df_q2 = pd.Series(data_q2)

In [37]:
df_q2

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

In [34]:
type(df_q2)

pandas.core.series.Series

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## Q3. Create a Pandas DataFrame that contains the following data:

|  Name  | Age | Gender |
|:------:|:---:|:------:|
|  Alice |  25 | Female |
|   Bob  |  30 |  Male  |
| Claire |  27 | Female |

## Then, print the DataFrame.

### Answer:

In [39]:
# Create the data
data_q3 = {"Name":['Alice','Bob','Claire'],
           "Age" :[25,30,27],
           "Gender" :['Female','Male','Female']
            }

# Create the DataFrame
df_q3 = pd.DataFrame(data_q3)

# Print the DataFrame
df_q3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## Q4. What is ‚ÄòDataFrame‚Äô in pandas and how is it different from pandas.series? Explain with an example.

### Answer:

In pandas, a `DataFrame` is a 2-dimensional labeled data structure with columns of potentially different data types, whereas a `Series` is a one-dimensional labeled array that can hold any data type.

A `DataFrame` can be thought of as a table with rows and columns, similar to a spreadsheet or SQL table, where each column can be considered as a `Series`. Each column of the DataFrame can have a different data type, such as integers, floats, or strings. 

The `DataFrame` also has row labels, called the index, which can be used to access and manipulate the data in the `DataFrame`.

On the other hand, a `Series` is a one-dimensional labeled array that can hold any data type, such as integers, floats, or strings. Each element in the `Series` has a label, called the index, which can be used to access and manipulate the data in the `Series`.

Here's an example that illustrates the difference between a `DataFrame` and a `Series`:

In [40]:
# Create a Series 
s = pd.Series([2,3,5,4,56,23],name='Numbers')

# Create a DataFrame 
data = {'Name' : ['Alice','Pankaj','Pawan'],
        'Age' : [34 , 23 , 17],
        'Gender' : ['Female','Male','Male']
        }

df = pd.DataFrame(data)

In [43]:
# Print the Series and DataFrame
print(s)
print('\n')
print(df)

0     2
1     3
2     5
3     4
4    56
5    23
Name: Numbers, dtype: int64


     Name  Age  Gender
0   Alice   34  Female
1  Pankaj   23    Male
2   Pawan   17    Male

In the above example, we have created a `Series` named `s` that contains some numbers, and a `DataFrame` named `df` that contains information about some people. The Series has a single column of data and is one-dimensional, while the `DataFrame` has three columns of data and is two-dimensional.

In summary, a `DataFrame` is a 2-dimensional labeled data structure with columns of potentially different data types, while a `Series` is a one-dimensional labeled array that can hold any data type. A `DataFrame` can be thought of as a collection of `Series`, with each column of the `DataFrame` being a `Series`.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

### Answer:

Pandas provides a wide range of functions that can be used to manipulate data in a DataFrame. Here are some commonly used functions:

1. `head()`: Returns the first n rows of the DataFrame. This function is useful to quickly check the contents of the DataFrame.

In [45]:
df_q5 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [47]:
df_q5.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

2. `tail()`: Returns the last n rows of the DataFrame. This function is useful to quickly check the contents of the DataFrame.

In [49]:
df_q5.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

3. `describe()`: Generates descriptive statistics of the DataFrame, such as the count, mean, standard deviation, minimum and maximum values, and quartiles. This function is useful to get an overview of the distribution of the data.

In [50]:
df_q5.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

4. `drop()`: Removes rows or columns from the DataFrame based on a specified index or label. This function is useful to remove irrelevant or incomplete data from the DataFrame.

In [52]:
df_q5 = df_q5.drop(index=[1,3,5]) #remove rows with index 1,3,5

df_q5

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [55]:
df_col = df_q5.drop(columns =['Cabin']) # remove column Cabin

In [56]:
df_col

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

5. `groupby()`: Groups the DataFrame by one or more columns and applies a function to each group. This function is useful to perform aggregations or transformations on subsets of the data.

In [57]:
grouped_df = df_q5.groupby(['Sex']).mean() # calculate the mean age for each gender

/tmp/ipykernel_85/2498286789.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped_df = df_q5.groupby(['Sex']).mean() # calculate the mean age for each gender

In [58]:
grouped_df

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,433.772436,0.740385,2.166667,27.849421,0.692308,0.653846,44.366280
male,454.925347,0.189236,2.388889,30.726645,0.430556,0.236111,25.553521

These are just a few examples of the functions that can be used to manipulate data in a Pandas DataFrame. The choice of which function to use depends on the specific data analysis task at hand.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

### Answer:

In Pandas, both `Series` and `DataFrame` are `mutable`, which means that you can modify their values after they have been created. On the other hand, Panel is deprecated since version 0.25.0 and has been replaced by the more general multi-dimensional arrays called `xarray`.

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

## Q7. Create a DataFrame using multiple Series. Explain with an example.

To create a DataFrame using multiple Series, you can pass the Series as a dictionary to the `pd.DataFrame()` constructor. Each Series will become a column in the resulting DataFrame.

Here is an example:

In [60]:
names = pd.Series(["Pankaj","Alice","Pawan","Soma"])
ages = pd.Series([25,30,27,45])
genders = pd.Series(['Male','FeMale','Male','Female'])

data_q7 = {'Name':names,'Ages':ages,'Gender':genders}

df_q7 = pd.DataFrame(data_q7)

df_q7

     Name  Ages  Gender
0  Pankaj    25    Male
1   Alice    30  FeMale
2   Pawan    27    Male
3    Soma    45  Female

In this example, we created three Series for the `Name`, `Age`, and `Gender` columns, respectively. We then combined the Series into a dictionary, where the keys are the column names and the values are the Series. Finally, we passed the dictionary to the `pd.DataFrame()` constructor to create the DataFrame.

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)